<?php

namespace App\Traits;

trait ResponsTrait
{

    /***********************************************/
    /**
     * دي ميثود عشان ترجع رساله خطا في ال اي بي اي 
     * انا هنا بمررلها رساله الخطأ  و الحاله اللي هي فولس
     * وممكن اعمل رقم للايرور بس انا مش هستخدمه 
     */
    public function returnError($msg,$status_code)
    {
        return response()->json([
            'status' => false,
            'msg' => $msg
        ],$status_code);
    }
    /************************************************/

    /************************************************/
    /**
     * دي ميثود عشان ترجع الداتا بالطريقه الصحيحه
     * بترجع الحاله اللي هي  ترو و بترجع الرساله اللي انا بمررها 
     * و بترجع الكي اللي انا بحدده و الداتا
     */
    // public function returnData($key, $value, $msg = "")
    // {
    //     return response()->json([
    //         'status' => true,
    //         // 'errNum' => "S000",
    //         'msg' => $msg,
    //         $key => $value
    //     ]);
    // }
    /************************************************/


    /************************************************/

    /**
     * دي عشان ترجع رساله نجاح  لو انا معملت اكشن معين مثلا
     */
    public function returnSuccessMessage($msg = "",$status_code)
    {
        return response()->json([
            'status' => true,
            'msg' => $msg
        ],$status_code);
    }
    /************************************************/






}

?>